In [1]:
import numpy as np 
import pandas as pd
from pandas import Series, DataFrame

In [2]:
# Create a dframe to work with (Highest elevation cities in USA)
df = DataFrame({'city':['Alma','Brian Head','Fox Park'],
                    'altitude':[3158,3000,2762]})
df

         city  altitude
0        Alma      3158
1  Brian Head      3000
2    Fox Park      2762

In [3]:
#Now say we wanted to add a column for the States, we can do that with a mapping.
state_map={'Alma':'Colorado','Brian Head':'Utah','Fox Park':'Wyoming'}

In [6]:
df['state'] = df['city'].map(state_map)

df

         city  altitude     state
0        Alma      3158  Colorado
1  Brian Head      3000      Utah
2    Fox Park      2762   Wyoming